driver-tests/bpelse/assign/AssignJbi/test/results/echoIDREFDataType_Invoke/Actual_20130314183855_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoIDREFDataType" xmlns:msgns="http://stc.com/echoIDREFDataType">
      <string>IDREF</string>
      <normalizedString>IDREF</normalizedString>
      <token>IDREF</token>
      <base64Binary>IDREF</base64Binary>
      <hexBinary>IDREF</hexBinary>
      <integer>IDREF</integer>
      <positiveInteger>IDREF</positiveInteger>
      <negativeInteger>IDREF</negativeInteger>
      <nonNegativeInteger>IDREF</nonNegativeInteger>
      <nonPositiveInteger>IDREF</nonPositiveInteger>
      <long>IDREF</long>
      <unsignedLong>IDREF</unsignedLong>
      <int>IDREF</int>
      <unsignedInt>IDREF</unsignedInt>
      <short>IDREF</short>
      <unsignedShort>IDREF</unsignedShort>
      <byte>IDREF</byte>
      <unsignedByte>IDREF</unsignedByte>
      <decimal>IDREF</decimal>
      <float>IDREF</float>
      <double>IDREF</double>
      <boolean>IDREF</boolean>
      <duration>IDREF</duration>
      <dateTime>IDREF</dateTime>
      <date>IDREF</date>
      <time>IDREF</time>
      <gYear>IDREF</gYear>
      <gYearMonth>IDREF</gYearMonth>
      <gMonth>IDREF</gMonth>
      <gMonthDay>IDREF</gMonthDay>
      <gDay>IDREF</gDay>
      <Name>IDREF</Name>
      <QName>IDREF</QName>
      <NCName>IDREF</NCName>
      <anyURI>IDREF</anyURI>
      <language>IDREF</language>
      <ID>IDREF</ID>
      <IDREF>IDREF</IDREF>
      <IDREFS>IDREF</IDREFS>
      <ENTITY>IDREF</ENTITY>
      <ENTITIES>IDREF</ENTITIES>
      <NMTOKEN>IDREF</NMTOKEN>
      <NMTOKENS>IDREF</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>